; domain
(define (domain blocksworld)
(:predicates (clear ?x)
             (ontable ?x)
             (on ?x ?y))

(:action move-b-to-b
  :parameters (?bm ?bf ?bt)
  :precondition (and (clear ?bm) (clear ?bt) (on ?bm ?bf))
  :effect (and (not (clear ?bt)) (not (on ?bm ?bf))
               (on ?bm ?bt) (clear ?bf)))

(:action move-b-to-t
  :parameters (?bm ?bf)
  :precondition (and (clear ?bm) (on ?bm ?bf))
  :effect (and (not (on ?bm ?bf))
               (ontable ?bm) (clear ?bf)))

(:action move-t-to-b
  :parameters (?bm ?bt)
  :precondition (and (clear ?bm) (clear ?bt) (ontable ?bm))
  :effect (and (not (clear ?bt)) (not (ontable ?bm))
               (on ?bm ?bt))))

; problem
(define (problem BW-rand-6)
(:domain blocksworld)
(:objects b1 b2 b3 b4 b5 b6 )
(:init
(on b1 b3)
(ontable b2)
(on b3 b6)
(on b4 b2)
(ontable b5)
(on b6 b5)
(clear b1)
(clear b4)
)
(:goal
(and
(on b3 b6)
(on b4 b1)
(on b5 b2))
)
)

; plan
1. (move-b-to-t b1 b3)
   deleted: (on b1 b3)
   added: (ontable b1) (clear b3)
   goals met: 1 of 3
2. (move-b-to-b b3 b6 b1)
   deleted: (clear b1) (on b3 b6)
   added: (on b3 b1) (clear b6)
   goals met: 0 of 3
3. (move-b-to-t b6 b5)
   deleted: (on b6 b5)
   added: (ontable b6) (clear b5)
   goals met: 0 of 3
4. (move-b-to-b b3 b1 b6)
   deleted: (clear b6) (on b3 b1)
   added: (on b3 b6) (clear b1)
   goals met: 1 of 3
5. (move-b-to-b b4 b2 b1)
   deleted: (clear b1) (on b4 b2)
   added: (on b4 b1) (clear b2)
   goals met: 2 of 3
6. (move-t-to-b b5 b2)
   deleted: (clear b2) (ontable b5)
   added: (on b5 b2)
   goals met: 3 of 3
